import React from "react";

// import

export default () => {
  return (
    <section className="section-space what-i-do">
      <div className="container is-fluid">
        <div className="columns">
          <div className="column has-text-centered">
            <h2 className="section-title">
              <strong>What I Do</strong>
            </h2>
          </div>
        </div>
        <div className="columns">
          <div className="column">
            <div className="what-i-do-content">
              <h3></h3>

              <p className="mb-5"  style={{ textIndent: 30 }}>
                ปัจจุบันผมเป็น Developer คนหนึ่งที่หลงไหลในการเขียนโปรเเกรมไม่ว่าจะเป็น frontend, backend เเละ infrastructure เป็นคนชอบทำอะไรไปเรื่อยอยู่ว่างไม่ได้ต้องหาอะไรทำ จนมีคติประจำใจที่ว่า
                "อย่าพูดว่าทำไม่ได้คิดไม่ออก ถ้ายังไม่เริ่มลงมือทำ" ผมคิดว่าโลกของโปรเเกรมเมอร์มันสวยเสมอ เเม้จะต้องฟันฝ่าอุปสรรคอะไรมากมายกว่าจะมาถึงจุดนนี้ได้ ผมได้เริ่มทำสิ่งที่ตัวเองรักเเละสิ่งที่ตัวเองชอบหลายๆอย่าง
                เหมือนกับว่าเป็นส่วนหนึ่งของชีวิตเข้าไปเเล้วฮ่าๆ 
              </p>

              <h3>เป้าหมาย bukton.xyz</h3>

              <p>
                การที่เราจะเริ่มทำอะไรสักอย่างเราจะเกิดความคาดหวังเล็กๆน้อยๆ หรือเป้าหมายที่เราอยากให้เป็นไปตามความคาดหวังของเรา bukton.xyz สร้างขึ้นมาเพราะว่าผมอยากมีเว็บไซต์เป็นของตัวเองเป็นเว็บไซต์เล็กๆ
                ที่ใครๆก็ได้สามารถเข้าถึงได้ทุกที่ เเละเป็นประโยชน์ต่อคนอื่นให้มากที่สุด ในปัจจุบันผมชอบ mini lab, ทดลองอะไรใหม่ๆรวมไปถึงการ research งานที่เป็นประโยชน์ต่อการทำงานในปัจจุบัน เพื่อสร้างความเข้าใจ ความมั่นใจในการทำงาน
                หรือเพื่อเเก้ปัญหาของงานที่เกิดขึ้นผมเลยมีเเนวคิดที่ว่า เมื่อเวลาทำอะไรจะเขียนเป็นบทความเล็กๆ เพื่อใช้เป็นคลังความรู้ เตือนความจำที่ผ่านมาได้ทำอะไรบ้าง เเละสามารถส่งต่อความรู้ให้กับผู้อื่นได้ด้วยเช่นกัน
                หากผมผิดพลาดประการใดหรือเข้าใจผิดส่วนไหน ผมน้อมรับคำติชมหรือการเเก้ไขให้ดีขึ้น
              </p>

              <ul>
                <li>
                  เเชร์ความรู้เเละประสบการณ์ที่ผ่านมา
                </li>
                <li>
                  เป็นคลังความรู้เล็กๆที่สามารถสร้างประโยชน์ให้กับผู้อื่นได้
                </li>
              </ul>

              <h3>ทำไมต้อง bukton.xyz</h3>

              <p>
                เป็นช่วงระหว่างฝึกงานซึ่งมี domain ที่เกิดขึ้นมาใหม่ชื่อ xyz ทำให้รู้สึกอยากได้ รู้สึกว่ามันเจ๋ง มันว้าวววมาก (ความคิดตอนนั้น) เเละก็อยากมีเว็บไซต์เล็กๆเป็นของตัวเองด้วย 
                เป็นเหตุผลที่ทำให้มีเว็บไซต์ชื่อ bukton.xyz
              </p>

              <h3> เราใช้อะไรบ้าง ที่ bukton.xyz </h3>

              <ul>
                <li>
                  React เป็น frontend framework ตัวหนึ่งที่ได้รับความนิยมลำดับต้นๆของการทำเว็บไซต์ในปัจจุบัน (ปล. ผมเลือกตัวที่ผมถนัดที่สุด)
                </li>
                <li>
                  Next.js เครื่องมือที่ทำให้เราสามารถสร้าง static web ด้วย React อย่างง่ายดาย
                </li>
                <li>
                  Bulma เป็น css framework ที่ผมเลือกมาใช้เพราะว่าอยากได้ css ขนาดเล็ก option ไม่เยอะมาก
                </li>
                <li>
                  Scss น่าสนใจมากทำให้ผมรู้สึกว่าผมสามารถเขียน css สนุกขึ้น หลงไหลเลยเเหละค๊าฟฟฟ
                </li>
                <li>
                  Firebase สำคัญมากขาดไม่ได้เลย ซึ่งปัจจุบันผมจะใช้ในส่วนของ firebase hosting เท่านั้น
                </li>
                <li>
                  Netlify คล้ายกับ Firebase hosting ข้อดีมีระบบ ci ให้ด้วย ทำให้การ deploy เป็นเรื่องง่ายเเค่คุณ "คลิก"
                </li>
                <li>
                  Circleci เป็น ci/cd tools ตัวหนึ่งที่ดีมากสำหรับผู้เริ่มต้นใช้งานได้ง่าย ทำ config นิดๆหน่อยๆ พร้อมทำงาน
                </li>
                <li>
                  Git Hub Repo: <a href='https://github.com/bukton123/bukton.xyz' > คลิก </a>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
};
